Files/Lenguajes/SQL.org
#+TITLE: Introducción a SQL
#+startup: fold
#+options: toc:4

[[file:~/org/Files/index.org][Índice]]

* TODO DDL: Creando y Manipulando Objetos de la Base de Datos
* DML: Manipulando La Infomación de Las Tablas
Una *Transacción* es un conjunto de instrucciones DML que trabajan como una únidad lógica.
** Insertando Información
- Con esta instrucción podemos insertar una fila a la vez.
- Opcionalmente, se listan las columas a las cuales se van a insertar los valores.
- Usa comillas simples para encerrar los valores de tipo *carácter* y las *fechas*.
*** Sin especificar columnas
Si no especificas columnas y no tienes valores para todas, debes llenar los campos con =NULL=.
#+begin_src sql
INSERT INTO
       clientes
VALUES
    ('Eugenio','Av. Técnologico',14,'4422274400');
#+end_src

*** Especificando columnas
#+begin_src sql
INSERT INTO
       clientes (nombre_cliente, calle_cliente, ciudad_cliente, telefono)
VALUES
    ('Guillermo','Escobedo',14,'4422274605')
#+end_src

*** Omitiendo columnas
Al omitir columas, las columnas a las cuales no se les asigna valor se les da valor nulo (=NULL=),
asi que solo las columnas que no tienen la restricción de =NOT NULL= pueden omitirse.
#+begin_src sql
INSERT INTO
       clientes (nombre_cliente, ciudad_cliente)
VALUES
    ('Guillermo',14)
#+end_src

*** Intsertando valores especiales (oracle)
**** Hora y fecha
la variable =SYSDATE= contiene la hora y fecha actual.
#+begin_src sql
INSERT INTO
       depositos (nombre_cliente, nombre_sucursal, monto, fecha)
VALUES
    ('Eugenio','Alamos', 100, SYSDATE)
#+end_src
Si se desea insertar una fecha determinada.
#+begin_src sql
INSERT INTO
       (id_alumno, nombre_alumno, sexo, pais_nacimiento, fecha_nacimiento, carrera)
VALUES
    (15,'Eugenio','M','México',TO_DATE('FEB 3, 97','MON DD, YY'),1000)
#+end_src

** Cambiando Información
El estatuto =UPDATE= Actualiza la información de las filas existentes en una tabla.
- Se pueden cambiar varias filas a la vez.
- Las filas actualizadas pueden ser filtradas con el estatuto =WHERE=.
- Si se omite el =WHERE=, todas las filas serán modificadas.
