Publ/Lenguajes/SQL.html
<!doctype html>
<html lang="en">
<head>
<title>Introducción a SQL</title>
<!-- 2020-12-25 Fri 16:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. DDL: Creando y Manipulando Objetos de la Base de Datos</a></li>
<li><a href="#sec-2">2. DML: Manipulando La Infomación de Las Tablas</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Insertando Información</a>
<ul class="nav">
<li><a href="#sec-2-1-1">2.1.1. Sin especificar columnas</a></li>
<li><a href="#sec-2-1-2">2.1.2. Especificando columnas</a></li>
<li><a href="#sec-2-1-3">2.1.3. Omitiendo columnas</a></li>
<li><a href="#sec-2-1-4">2.1.4. Intsertando valores especiales (oracle)</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Cambiando Información</a>
<ul class="nav">
<li><a href="#sec-2-2-1">2.2.1. Ejemplo</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Eliminando Infomrmación</a>
<ul class="nav">
<li><a href="#sec-2-3-1">2.3.1. Ejemplo</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. DML: Iniciando en Consultas SQL</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. SELECT</a>
<ul class="nav">
<li><a href="#sec-3-1-1">3.1.1. Capacidades:</a></li>
<li><a href="#sec-3-1-2">3.1.2. Estructura</a></li>
<li><a href="#sec-3-1-3">3.1.3. Mostrando todas las columnas</a></li>
<li><a href="#sec-3-1-4">3.1.4. DISTINCT</a></li>
<li><a href="#sec-3-1-5">3.1.5. Alias</a></li>
<li><a href="#sec-3-1-6">3.1.6. Expreciones</a></li>
<li><a href="#sec-3-1-7">3.1.7. Evaluación de valores nulos</a></li>
<li><a href="#sec-3-1-8">3.1.8. Concatenación de cadenas</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. WHERE</a>
<ul class="nav">
<li><a href="#sec-3-2-1">3.2.1. Capacidades</a></li>
<li><a href="#sec-3-2-2">3.2.2. Estructura</a></li>
<li><a href="#sec-3-2-3">3.2.3. Cadenas de caracteres y fechas</a></li>
<li><a href="#sec-3-2-4">3.2.4. Operadores de comparación</a></li>
<li><a href="#sec-3-2-5">3.2.5. Operador BETWEEN</a></li>
<li><a href="#sec-3-2-6">3.2.6. Operador IN</a></li>
<li><a href="#sec-3-2-7">3.2.7. Operador LIKE</a></li>
<li><a href="#sec-3-2-8">3.2.8. Operador IS NULL</a></li>
<li><a href="#sec-3-2-9">3.2.9. Operadores lógicos</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. ORDER BY</a>
<ul class="nav">
<li><a href="#sec-3-3-1">3.3.1. Decendente y Acentendente</a></li>
<li><a href="#sec-3-3-2">3.3.2. Podemos ordenar múltiples columas en un orden</a></li>
<li><a href="#sec-3-3-3">3.3.3. Ordenando con columnas no proyectadas</a></li>
<li><a href="#sec-3-3-4">3.3.4. Ordenando con expresiones</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. DML: Funciones Sobre Filas Individuales</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. Funciones caracter</a>
<ul class="nav">
<li><a href="#sec-4-1-1">4.1.1. Case Conversion Function</a></li>
<li><a href="#sec-4-1-2">4.1.2. Ejemplo</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Funciones de manpulación de caracteres</a>
<ul class="nav">
<li><a href="#sec-4-2-1">4.2.1. Ejemplo</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Funciones Númericas</a></li>
<li><a href="#sec-4-4">4.4. Trabajando con Fechas</a>
<ul class="nav">
<li><a href="#sec-4-4-1">4.4.1. Usando Funciones de Fecha</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5. Conversión Implicita de Tipos de Datos</a></li>
<li><a href="#sec-4-6">4.6. Función TO<sub>CHAR</sub> con Fechas</a>
<ul class="nav">
<li><a href="#sec-4-6-1">4.6.1. Modelos de formato para fechas</a></li>
<li><a href="#sec-4-6-2">4.6.2. Ejemplos de formato</a></li>
<li><a href="#sec-4-6-3">4.6.3. Ejemplo de uso</a></li>
</ul>
</li>
<li><a href="#sec-4-7">4.7. Función TO<sub>CHAR</sub> con Números</a>
<ul class="nav">
<li><a href="#sec-4-7-1">4.7.1. Ejemplo</a></li>
<li><a href="#sec-4-7-2">4.7.2. Funciones <code>TO_NUMBER</code> y <code>TO_DATE</code></a></li>
</ul>
</li>
<li><a href="#sec-4-8">4.8. Función NVL</a>
<ul class="nav">
<li><a href="#sec-4-8-1">4.8.1. Ejemplo</a></li>
</ul>
</li>
<li><a href="#sec-4-9">4.9. Función DECODE</a>
<ul class="nav">
<li><a href="#sec-4-9-1">4.9.1. Ejemplo</a></li>
</ul>
</li>
<li><a href="#sec-4-10">4.10. Anidando Funciones</a></li>
</ul>
</li>
<li><a href="#sec-5">5. DML: Obtieniendo Información de Múltiples Tablas</a>
<ul class="nav">
<li><a href="#sec-5-1">5.1. ¿Qué es una reunión? (JOIN)</a>
<ul class="nav">
<li><a href="#sec-5-1-1">5.1.1. Producto cartesiano</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. Tipos de reuniones</a>
<ul class="nav">
<li><a href="#sec-5-2-1">5.2.1. Equi join</a></li>
<li><a href="#sec-5-2-2">5.2.2. Non-equi join</a></li>
<li><a href="#sec-5-2-3">5.2.3. Outer join</a></li>
<li><a href="#sec-5-2-4">5.2.4. Self join</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. DML: Funciones de Agregación</a>
<ul class="nav">
<li><a href="#sec-6-1">6.1. Funciones de grupo</a></li>
<li><a href="#sec-6-2">6.2. Funciones con Argumentos Númericos</a></li>
<li><a href="#sec-6-3">6.3. Función COUNT</a></li>
<li><a href="#sec-6-4">6.4. Creando grupos de datos</a>
<ul class="nav">
<li><a href="#sec-6-4-1">6.4.1. Ejemplo</a></li>
<li><a href="#sec-6-4-2">6.4.2. Consultas Ilegales</a></li>
<li><a href="#sec-6-4-3">6.4.3. Cláusula HAVING</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. DML: Subconsultas</a>
<ul class="nav">
<li><a href="#sec-7-1">7.1. Subconsultas de Una Sola Fila</a>
<ul class="nav">
<li><a href="#sec-7-1-1">7.1.1. Ejemplo</a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2. Subconsultas de Múltiples filas</a>
<ul class="nav">
<li><a href="#sec-7-2-1">7.2.1. Ejemplo</a></li>
</ul>
</li>
<li><a href="#sec-7-3">7.3. Subconsultas de múltiples columnas</a>
<ul class="nav">
<li><a href="#sec-7-3-1">7.3.1. Ejemplo</a></li>
<li><a href="#sec-7-3-2">7.3.2. Subconsultas en la cáusula FROM</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-8">8. DML: Creando y Manipulando Objetos de la Base de Datos</a>
<ul class="nav">
<li><a href="#sec-8-1">8.1. Creando una tabla usando consultas</a>
<ul class="nav">
<li><a href="#sec-8-1-1">8.1.1. Ejemplo: Creando tablas permanentes</a></li>
<li><a href="#sec-8-1-2">8.1.2. Ejemplo: Creando tablas temporales</a></li>
</ul>
</li>
<li><a href="#sec-8-2">8.2. Cereando una tabla usando Subconsultas</a>
<ul class="nav">
<li><a href="#sec-8-2-1">8.2.1. Ejemplo</a></li>
</ul>
</li>
<li><a href="#sec-8-3">8.3. Vistas</a>
<ul class="nav">
<li><a href="#sec-8-3-1">8.3.1. ¿Por qué vistas?</a></li>
<li><a href="#sec-8-3-2">8.3.2. Estructura de las vistas</a></li>
<li><a href="#sec-8-3-3">8.3.3. Creando vistas</a></li>
<li><a href="#sec-8-3-4">8.3.4. Tipos de vistas</a></li>
<li><a href="#sec-8-3-5">8.3.5. Modificando una Vista</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Introducción a SQL</h1>
<p>
<a href="1000_KnowledgeMOC.html">Knowledge Index</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="label label-primary TODO">TODO</span> DDL: Creando y Manipulando Objetos de la Base de Datos</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> DML: Manipulando La Infomación de Las Tablas</h2>
<div class="outline-text-2" id="text-2">
<p>
Una <b>Transacción</b> es un conjunto de instrucciones DML que trabajan como una únidad lógica.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Insertando Información</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Con esta instrucción podemos insertar una fila a la vez.
</li>
<li>Opcionalmente, se listan las columas a las cuales se van a insertar los valores.
</li>
<li>Usa comillas simples para encerrar los valores de tipo <b>carácter</b> y las <b>fechas</b>.
</li>
</ul>
</div>
<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Sin especificar columnas</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Si no especificas columnas y no tienes valores para todas, debes llenar los campos con <code>NULL</code>.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">INSERT</span> <span style="color: #81A1C1; font-style: italic;">INTO</span>
       clientes
<span style="color: #81A1C1; font-style: italic;">VALUES</span>
    (<span style="color: #A3BE8C;">'Eugenio'</span>,<span style="color: #A3BE8C;">'Av. T&#233;cnologico'</span>,<span style="color: #B48EAD; font-weight: bold;">14</span>,<span style="color: #A3BE8C;">'4422274400'</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Especificando columnas</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">INSERT</span> <span style="color: #81A1C1; font-style: italic;">INTO</span>
       clientes (nombre_cliente, calle_cliente, ciudad_cliente, telefono)
<span style="color: #81A1C1; font-style: italic;">VALUES</span>
    (<span style="color: #A3BE8C;">'Guillermo'</span>,<span style="color: #A3BE8C;">'Escobedo'</span>,<span style="color: #B48EAD; font-weight: bold;">14</span>,<span style="color: #A3BE8C;">'4422274605'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Omitiendo columnas</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Al omitir columas, las columnas a las cuales no se les asigna valor se les da valor nulo (<code>NULL</code>),
asi que solo las columnas que no tienen la restricción de <code>NOT NULL</code> pueden omitirse.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">INSERT</span> <span style="color: #81A1C1; font-style: italic;">INTO</span>
       clientes (nombre_cliente, ciudad_cliente)
<span style="color: #81A1C1; font-style: italic;">VALUES</span>
    (<span style="color: #A3BE8C;">'Guillermo'</span>,<span style="color: #B48EAD; font-weight: bold;">14</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Intsertando valores especiales (oracle)</h4>
<div class="outline-text-4" id="text-2-1-4">
</div><ol class="org-ol"><li><a id="sec-2-1-4-1" name="sec-2-1-4-1"></a>Hora y fecha<br ><div class="outline-text-5" id="text-2-1-4-1">
<p>
la variable <code>SYSDATE</code> contiene la hora y fecha actual.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">INSERT</span> <span style="color: #81A1C1; font-style: italic;">INTO</span>
       depositos (nombre_cliente, nombre_sucursal, monto, fecha)
<span style="color: #81A1C1; font-style: italic;">VALUES</span>
    (<span style="color: #A3BE8C;">'Eugenio'</span>,<span style="color: #A3BE8C;">'Alamos'</span>, <span style="color: #B48EAD; font-weight: bold;">100</span>, SYSDATE)
</pre>
</div>
<p>
Si se desea insertar una fecha determinada.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">INSERT</span> <span style="color: #81A1C1; font-style: italic;">INTO</span>
       (id_alumno, nombre_alumno, sexo, pais_nacimiento, fecha_nacimiento, carrera)
<span style="color: #81A1C1; font-style: italic;">VALUES</span>
    (<span style="color: #B48EAD; font-weight: bold;">15</span>,<span style="color: #A3BE8C;">'Eugenio'</span>,<span style="color: #A3BE8C;">'M'</span>,<span style="color: #A3BE8C;">'M&#233;xico'</span>,TO_DATE(<span style="color: #A3BE8C;">'FEB 3, 97'</span>,<span style="color: #A3BE8C;">'MON DD, YY'</span>),<span style="color: #B48EAD; font-weight: bold;">1000</span>)
</pre>
</div>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Cambiando Información</h3>
<div class="outline-text-3" id="text-2-2">
<p>
El estatuto <code>UPDATE</code> Actualiza la información de las filas existentes en una tabla.
</p>
<ul class="org-ul">
<li>Se pueden cambiar varias filas a la vez.
</li>
<li>Las filas actualizadas pueden ser filtradas con el estatuto <code>WHERE</code>.
</li>
<li>Si se omite el <code>WHERE</code>, todas las filas serán modificadas.
</li>
</ul>
</div>
