Files/Lenguajes/SQL.org
*** Ejemplo
Cambiando el nombre de la sucursal.
#+begin_src sql
UPDATE
    sucursales
SET
    nombre_sucursal='Álamos'
WHERE
    nombre_sucursal='Alamos'
#+end_src
Cambiando el pais de nacimiento de todos los alumnos.
#+begin_src sql
UPDATE
    alumnos
SET
    pais_nacimiento='México';
#+end_src

** Eliminando Infomrmación
Puedes eliminar filas existentes de una tabla usando el estatuto =DELETE=.
- Las filas que cumplan con la condición =WHERE= serán eliminadas.
- Si se omite la cláusula =WHERE= todas las filas serán eliminadas.
*** Ejemplo
#+begin_src sql
DELETE [FROM] nombre_tabla
[WHERE condición]
#+end_src

* DML: Iniciando en Consultas SQL
** SELECT
*** Capacidades:
- Selección: Selecciona las filas
- Proyección: Selecciona las columnas
- Reunión: Une dos columnas
*** Estructura
- SELECT: Lista que columnas van a tener los resultados
- FROM: De que tablas se va a obtener
- WHERE: Las condiciónes de reunión
**** Ejemplo
#+begin_src sql
SELECT
    id_cliente, nombre_cliente, calle_cliente
FROM
    clientes
#+end_src

*** Mostrando todas las columnas
Se puede mostrar todas las columnas de la tabla con un =*=
#+description: Selecciona todas las columnas de la tabla clientes
#+begin_src sql
SELECT *
FROM
    clientes
#+end_src

#+description: Selecciona todas las columnas de las tablas clientes y departmens
#+begin_src sql
SELECT *
FROM
    employees, departments
#+end_src

#+description: Selecciona todas las columnas de la tabla employees
#+begin_src sql
SELECT
    employees*
FROM
    employees
#+end_src

*** DISTINCT
Para mostrar solo los valores diferentes de las columnas usamos la palabra reservada DISTINCT
#+begin_src sql
--Muestra solo los valores diferentes(unicos)
SELECT
    DISTINCT department_id
FROM
    employees
#+end_src

*** Alias
Podemos poner un alias a las columnas del resultado.
#+begin_src sql
SELECT
    salary AS "Salario Anual"
FROM
    employees
#+end_src

*** Expreciones
El =SELECT= puede contener expreciones con los operadores =+, -, * o /=.
#+begin_src sql
-- Podemos usar párentesís para cambiar la procedencia de los operadores
SELECT
    (salary+300)*12
FROM
    employees
#+end_src

*** Evaluación de valores nulos
En *Oracle*, la función =NVL= permite convertir un valor nulo a uno válido
#+begin_src sql
-- NVL(columna,valor a dar a los nulos)
SELECT
    last_name,
    salary*12,
    NVL(commision_pct,0),
    NVL(hire_date,'2013-05-12'),
    NVL(phone_number, 'Sin telefono')
FROM
    employees
#+end_src

*** Concatenación de cadenas
Se pueden concatenar cadenas o columnas con el operador =|| o += (depende de el manejador)
#+begin_src sql
-- Nombre apellido
SELECT
    last_name||' '||first_name
FROM
    employees
#+end_src

** WHERE
*** Capacidades
La cláusula =WHERE= permite filtar los resultados de vienen de la cláusula =SELECT=,
Esta es colocada despues de la cláusula =FROM=.
*** Estructura
#+begin_src sql
SELECT
    columas
FROM
    tablas
WHERE
    condiciones
#+end_src
**** Ejemplo
#+description: esta consulta mostrará todas las columnas de la tabla employees donde department_id sea igual a 60
#+begin_src sql
SELECT *
FROM
    employees
WHERE
    department_id = 60;
#+end_src

*** Cadenas de caracteres y fechas
- Los caracteres de tipo string y fechas son delimitados con comillas simples.
- Son sensibles a Mayusculas.
- Las fechas son sensibles a un formato, para conocer este formato podemos hacer.
  #+begin_src sql
SELECT sysdate
FROM dual;
  #+end_src
- Las fechas pueden requerir la función =TO_DATE= para ser utilizadas en el =WHERE=.
*** Operadores de comparación
Se pueden usar los operadores de comparación \=, >,>\= y !=
#+begin_src sql
SELECT
    last_name, salary, commision_pct
FROM
    employees
WHERE
    commision_pct <= .2;
#+end_src

*** Operador BETWEEN
Este opreador se puede usar con cualquer tipo de dato y filtra entre dos valores dados (inclusivo)
#+begin_src sql
SELECT
    last_name, salary
FROM
    employees
WHERE
    salary BETWEEN 1500 AND 25000;
#+end_src

