Publ/Lenguajes/SQL.html
<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Cambiando el nombre de la sucursal.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">UPDATE</span>
    sucursales
<span style="color: #81A1C1; font-style: italic;">SET</span>
    nombre_sucursal=<span style="color: #A3BE8C;">'&#193;lamos'</span>
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    nombre_sucursal=<span style="color: #A3BE8C;">'Alamos'</span>
</pre>
</div>
<p>
Cambiando el pais de nacimiento de todos los alumnos.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">UPDATE</span>
    alumnos
<span style="color: #81A1C1; font-style: italic;">SET</span>
    pais_nacimiento=<span style="color: #A3BE8C;">'M&#233;xico'</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Eliminando Infomrmación</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Puedes eliminar filas existentes de una tabla usando el estatuto <code>DELETE</code>.
</p>
<ul class="org-ul">
<li>Las filas que cumplan con la condición <code>WHERE</code> serán eliminadas.
</li>
<li>Si se omite la cláusula <code>WHERE</code> todas las filas serán eliminadas.
</li>
</ul>
</div>
<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">DELETE</span> [<span style="color: #81A1C1; font-style: italic;">FROM</span>] nombre_tabla
[<span style="color: #81A1C1; font-style: italic;">WHERE</span> condici&#243;n]
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> DML: Iniciando en Consultas SQL</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> SELECT</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Capacidades:</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Selección: Selecciona las filas
</li>
<li>Proyección: Selecciona las columnas
</li>
<li>Reunión: Une dos columnas
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Estructura</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>SELECT: Lista que columnas van a tener los resultados
</li>
<li>FROM: De que tablas se va a obtener
</li>
<li>WHERE: Las condiciónes de reunión
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-3-1-2-1" name="sec-3-1-2-1"></a>Ejemplo<br ><div class="outline-text-5" id="text-3-1-2-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    id_cliente, nombre_cliente, calle_cliente
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    clientes
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Mostrando todas las columnas</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Se puede mostrar todas las columnas de la tabla con un <code>*</code>
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span> *
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    clientes
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span> *
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees, departments
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    employees*
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> DISTINCT</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Para mostrar solo los valores diferentes de las columnas usamos la palabra reservada DISTINCT
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #6f7787; font-style: italic;">--Muestra solo los valores diferentes(unicos)</span>
<span style="color: #81A1C1; font-style: italic;">SELECT</span>
    <span style="color: #81A1C1; font-style: italic;">DISTINCT</span> department_id
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> Alias</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
Podemos poner un alias a las columnas del resultado.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    salary <span style="color: #81A1C1; font-style: italic;">AS</span> "Salario Anual"
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> Expreciones</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
El <code>SELECT</code> puede contener expreciones con los operadores <code>+, -, * o /</code>.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #6f7787; font-style: italic;">-- Podemos usar p&#225;rentes&#237;s para cambiar la procedencia de los operadores</span>
<span style="color: #81A1C1; font-style: italic;">SELECT</span>
    (salary+<span style="color: #B48EAD; font-weight: bold;">300</span>)*<span style="color: #B48EAD; font-weight: bold;">12</span>
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-7" class="outline-4">
<h4 id="sec-3-1-7"><span class="section-number-4">3.1.7</span> Evaluación de valores nulos</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
En <b>Oracle</b>, la función <code>NVL</code> permite convertir un valor nulo a uno válido
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #6f7787; font-style: italic;">-- NVL(columna,valor a dar a los nulos)</span>
<span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name,
    salary*<span style="color: #B48EAD; font-weight: bold;">12</span>,
    NVL(commision_pct,<span style="color: #B48EAD; font-weight: bold;">0</span>),
    NVL(hire_date,<span style="color: #A3BE8C;">'2013-05-12'</span>),
    NVL(phone_number, <span style="color: #A3BE8C;">'Sin telefono'</span>)
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-8" class="outline-4">
<h4 id="sec-3-1-8"><span class="section-number-4">3.1.8</span> Concatenación de cadenas</h4>
<div class="outline-text-4" id="text-3-1-8">
<p>
Se pueden concatenar cadenas o columnas con el operador <code>|| o +</code> (depende de el manejador)
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #6f7787; font-style: italic;">-- Nombre apellido</span>
<span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name||<span style="color: #A3BE8C;">' '</span>||first_name
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> WHERE</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Capacidades</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
La cláusula <code>WHERE</code> permite filtar los resultados de vienen de la cláusula <code>SELECT</code>,
Esta es colocada despues de la cláusula <code>FROM</code>.
</p>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Estructura</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    columas
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    tablas
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    condiciones
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="sec-3-2-2-1" name="sec-3-2-2-1"></a>Ejemplo<br ><div class="outline-text-5" id="text-3-2-2-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span> *
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    department_id = <span style="color: #B48EAD; font-weight: bold;">60</span>;
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Cadenas de caracteres y fechas</h4>
<div class="outline-text-4" id="text-3-2-3">
<ul class="org-ul">
<li>Los caracteres de tipo string y fechas son delimitados con comillas simples.
</li>
<li>Son sensibles a Mayusculas.
</li>
<li>Las fechas son sensibles a un formato, para conocer este formato podemos hacer.
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span> sysdate
<span style="color: #81A1C1; font-style: italic;">FROM</span> dual;
</pre>
</div>
</li>
<li>Las fechas pueden requerir la función <code>TO_DATE</code> para ser utilizadas en el <code>WHERE</code>.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> Operadores de comparación</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Se pueden usar los operadores de comparación \=, &gt;,&gt;\= y !=
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, salary, commision_pct
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    commision_pct &lt;= .<span style="color: #B48EAD; font-weight: bold;">2</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2-5" class="outline-4">
<h4 id="sec-3-2-5"><span class="section-number-4">3.2.5</span> Operador BETWEEN</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
Este opreador se puede usar con cualquer tipo de dato y filtra entre dos valores dados (inclusivo)
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, salary
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    salary <span style="color: #81A1C1; font-style: italic;">BETWEEN</span> <span style="color: #B48EAD; font-weight: bold;">1500</span> <span style="color: #81A1C1; font-style: italic;">AND</span> <span style="color: #B48EAD; font-weight: bold;">25000</span>;
</pre>
</div>
</div>
</div>
