Files/Lenguajes/SQL.org
*** Operador IN
Concuerda con cualquer valor contenido en la lista. =IN(lista de valores)=
#+begin_src sql
SELECT
    last_name, salary, manager_id
FROM
    employees
WHERE
    manager_id IN (120, 123);
#+end_src

*** Operador LIKE
Sirve para hacer búsquedas con comodines de cadenas de caracteres.
- El símbolo =%= representa cero o varios caracteres.
- El símbolo =_= representa un cáracter.
#+begin_src sql
SELECT last_name
FROM employees
WHERE last_name LIKE 'S%';
#+end_src
Podemos combinar ambos patrones para concordar con una busqueda más compleja.
*** Operador IS NULL
Se usa para buscar valores nulos.
#+begin_src sql
SELECT
    last_name, manager_id
FROM
    employees
WHERE
    manager_id IS NULL;
#+end_src

*** Operadores lógicos
Estos operadores pueden ser usados con los () para hacer busquedas más específicas.
**** Operador AND
#+begin_src sql
SELECT
    employee_id, last_name, job_id, salary
FROM
    employees
WHERE
    salary >= 1100
    AND job_id='SA_MAN'
#+end_src

**** Operador OR
#+begin_src sql
SELECT
    employee_id, last_name, job_id, salary
FROM
    employees
WHERE
    salary >= 11000
    OR job_id='SA_MAN';
#+end_src

**** Operador NOT
#+begin_src sql
SELECT
    employee_id, last_name, job_id, salary
FROM
    employees
WHERE
    job_id NOT IN ('HR_REP','MK_REP'
                  'SA_REP','PU_MAN');
#+end_src

** ORDER BY
Esta cláusula nos permite ordenar las tablas de salida, puede ser
- =ASC= : de manera acendente.
- =DESC= : de manera decendente.
Esta clausula siempre debe estar al final, en la últma instrucción.
*** Decendente y Acentendente
Por defecto se ordena de manera acendente.
#+begin_src sql
SELECT
    last_name, salary*12, department_id, hire_date AS "Fecha de Contrato"
FROM
    employees
ORDER BY
      hire_date DESC;
#+end_src
En =ORDER BY= podemos ordenar llamando al alias de hire_date =ORDER BY "Fecha de Contrato" DESC;=.
*** Podemos ordenar múltiples columas en un orden
#+begin_src sql
SELECT
    last_name, salary*12, department_id depto, hire_date AS "Fecha de Contrato"
FROM
    employees
ORDER BY
      depto, hire_date;
#+end_src

*** Ordenando con columnas no proyectadas
#+begin_src sql
SELECT
    last_name, salary, department_id
FROM
    employees
ORDER BY
      job_id;
#+end_src
Podemos ordenar en base a columnas no proyectadas con el =SELECT=.
*** Ordenando con expresiones
#+begin_src sql
SELECT
    last_name, salary, department_id
FROM
    employees
ORDER BY
      salary*12;
#+end_src
Podemos usar expreciones para ordenar nuestras columnas.
* DML: Funciones Sobre Filas Individuales
- Manipulan unidades de dato.
- Varios argumentos, un valor de salida.
- Actuan sobre cada una de las filas regresadas.
- Regresan un resultado por fila.
- Pueden modificar tipos de dato.
- Pueden ser anidadas.
  + =nombre_funcion (columna | expreción , [arg1,arg2,...])=
** Funciones caracter
*** Case Conversion Function
Cambian las mayúsculas y minúsculas de cadenas de caracteres.
| Función                 | Resultado  |
|-------------------------+------------|
| =LOWER('SQL Course')=   | sql course |
| =UPPER('SQL Course')=   | SQL COURSE |
| =INITCAP('SQL Course')= | Sql Course |

*** Ejemplo
Si desconocemos cómo esta la información en la base de datos,
nos conviene convertir a minúsculas lo que obtenemos de la base de datos y hacer la comparación.
#+begin_src sql
SELECT
    employee_id, last_name, department_id
FROM
    employee
WHERE
    LOWER(last_name) = 'king';
#+end_src

** Funciones de manpulación de caracteres
Manipulan caracteres.
| Función                   | Resultado  |
|---------------------------+------------|
| =CONCAT('Good','String')= | GoodSrting |
| =SUBSTR('String',1,3)=    | Str        |
| =LENGTH('String')=        | 6          |
| =INSTR('String',r)=       | 3          |
| =LPAD(SALARY,10,'*')=     | ******500  |
