Publ/Lenguajes/SQL.html

<div id="outline-container-sec-3-2-6" class="outline-4">
<h4 id="sec-3-2-6"><span class="section-number-4">3.2.6</span> Operador IN</h4>
<div class="outline-text-4" id="text-3-2-6">
<p>
Concuerda con cualquer valor contenido en la lista. <code>IN(lista de valores)</code>
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, salary, manager_id
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    manager_id <span style="color: #81A1C1; font-style: italic;">IN</span> (<span style="color: #B48EAD; font-weight: bold;">120</span>, <span style="color: #B48EAD; font-weight: bold;">123</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2-7" class="outline-4">
<h4 id="sec-3-2-7"><span class="section-number-4">3.2.7</span> Operador LIKE</h4>
<div class="outline-text-4" id="text-3-2-7">
<p>
Sirve para hacer búsquedas con comodines de cadenas de caracteres.
</p>
<ul class="org-ul">
<li>El símbolo <code>%</code> representa cero o varios caracteres.
</li>
<li>El símbolo <code>_</code> representa un cáracter.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span> last_name
<span style="color: #81A1C1; font-style: italic;">FROM</span> employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span> last_name <span style="color: #81A1C1; font-style: italic;">LIKE</span> <span style="color: #A3BE8C;">'S%'</span>;
</pre>
</div>
<p>
Podemos combinar ambos patrones para concordar con una busqueda más compleja.
</p>
</div>
</div>
<div id="outline-container-sec-3-2-8" class="outline-4">
<h4 id="sec-3-2-8"><span class="section-number-4">3.2.8</span> Operador IS NULL</h4>
<div class="outline-text-4" id="text-3-2-8">
<p>
Se usa para buscar valores nulos.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, manager_id
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    manager_id <span style="color: #81A1C1; font-style: italic;">IS</span> <span style="color: #81A1C1; font-style: italic;">NULL</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2-9" class="outline-4">
<h4 id="sec-3-2-9"><span class="section-number-4">3.2.9</span> Operadores lógicos</h4>
<div class="outline-text-4" id="text-3-2-9">
<p>
Estos operadores pueden ser usados con los () para hacer busquedas más específicas.
</p>
</div>
<ol class="org-ol"><li><a id="sec-3-2-9-1" name="sec-3-2-9-1"></a>Operador AND<br ><div class="outline-text-5" id="text-3-2-9-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    employee_id, last_name, job_id, salary
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    salary &gt;= <span style="color: #B48EAD; font-weight: bold;">1100</span>
    <span style="color: #81A1C1; font-style: italic;">AND</span> job_id=<span style="color: #A3BE8C;">'SA_MAN'</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-3-2-9-2" name="sec-3-2-9-2"></a>Operador OR<br ><div class="outline-text-5" id="text-3-2-9-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    employee_id, last_name, job_id, salary
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    salary &gt;= <span style="color: #B48EAD; font-weight: bold;">11000</span>
    <span style="color: #81A1C1; font-style: italic;">OR</span> job_id=<span style="color: #A3BE8C;">'SA_MAN'</span>;
</pre>
</div>
</div>
</li>

<li><a id="sec-3-2-9-3" name="sec-3-2-9-3"></a>Operador NOT<br ><div class="outline-text-5" id="text-3-2-9-3">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    employee_id, last_name, job_id, salary
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    job_id <span style="color: #81A1C1; font-style: italic;">NOT</span> <span style="color: #81A1C1; font-style: italic;">IN</span> (<span style="color: #A3BE8C;">'HR_REP'</span>,<span style="color: #A3BE8C;">'MK_REP'</span>
                  <span style="color: #A3BE8C;">'SA_REP'</span>,<span style="color: #A3BE8C;">'PU_MAN'</span>);
</pre>
</div>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> ORDER BY</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Esta cláusula nos permite ordenar las tablas de salida, puede ser
</p>
<ul class="org-ul">
<li><code>ASC</code> : de manera acendente.
</li>
<li><code>DESC</code> : de manera decendente.
</li>
</ul>
<p>
Esta clausula siempre debe estar al final, en la últma instrucción.
</p>
</div>
<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Decendente y Acentendente</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Por defecto se ordena de manera acendente.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, salary*<span style="color: #B48EAD; font-weight: bold;">12</span>, department_id, hire_date <span style="color: #81A1C1; font-style: italic;">AS</span> "Fecha de Contrato"
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">ORDER</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
      hire_date <span style="color: #81A1C1; font-style: italic;">DESC</span>;
</pre>
</div>
<p>
En <code>ORDER BY</code> podemos ordenar llamando al alias de hire<sub>date</sub> <code>ORDER BY "Fecha de Contrato" DESC;</code>.
</p>
</div>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Podemos ordenar múltiples columas en un orden</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, salary*<span style="color: #B48EAD; font-weight: bold;">12</span>, department_id depto, hire_date <span style="color: #81A1C1; font-style: italic;">AS</span> "Fecha de Contrato"
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">ORDER</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
      depto, hire_date;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> Ordenando con columnas no proyectadas</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, salary, department_id
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">ORDER</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
      job_id;
</pre>
</div>
<p>
Podemos ordenar en base a columnas no proyectadas con el <code>SELECT</code>.
</p>
</div>
</div>
<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4"><span class="section-number-4">3.3.4</span> Ordenando con expresiones</h4>
<div class="outline-text-4" id="text-3-3-4">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, salary, department_id
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">ORDER</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
      salary*<span style="color: #B48EAD; font-weight: bold;">12</span>;
</pre>
</div>
<p>
Podemos usar expreciones para ordenar nuestras columnas.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> DML: Funciones Sobre Filas Individuales</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Manipulan unidades de dato.
</li>
<li>Varios argumentos, un valor de salida.
</li>
<li>Actuan sobre cada una de las filas regresadas.
</li>
<li>Regresan un resultado por fila.
</li>
<li>Pueden modificar tipos de dato.
</li>
<li>Pueden ser anidadas.
<ul class="org-ul">
<li><code>nombre_funcion (columna | expreción , [arg1,arg2,...])</code>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Funciones caracter</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Case Conversion Function</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Cambian las mayúsculas y minúsculas de cadenas de caracteres.
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Función</th>
<th scope="col" class="text-left">Resultado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left"><code>LOWER('SQL Course')</code></td>
<td class="text-left">sql course</td>
</tr>

<tr>
<td class="text-left"><code>UPPER('SQL Course')</code></td>
<td class="text-left">SQL COURSE</td>
</tr>

<tr>
<td class="text-left"><code>INITCAP('SQL Course')</code></td>
<td class="text-left">Sql Course</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Ejemplo</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Si desconocemos cómo esta la información en la base de datos,
nos conviene convertir a minúsculas lo que obtenemos de la base de datos y hacer la comparación.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    employee_id, last_name, department_id
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employee
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    <span style="color: #81A1C1;">LOWER</span>(last_name) = <span style="color: #A3BE8C;">'king'</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Funciones de manpulación de caracteres</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Manipulan caracteres.
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Función</th>
<th scope="col" class="text-left">Resultado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left"><code>CONCAT('Good','String')</code></td>
<td class="text-left">GoodSrting</td>
</tr>

<tr>
<td class="text-left"><code>SUBSTR('String',1,3)</code></td>
<td class="text-left">Str</td>
</tr>

<tr>
<td class="text-left"><code>LENGTH('String')</code></td>
<td class="text-left">6</td>
</tr>

<tr>
<td class="text-left"><code>INSTR('String',r)</code></td>
<td class="text-left">3</td>
</tr>

<tr>
<td class="text-left"><code>LPAD(SALARY,10,'*')</code></td>
<td class="text-left">******500</td>
</tr>
</tbody>
</table>
</div>
