Files/Lenguajes/SQL.org
*** Ejemplo

#+begin_src sql
SELECT
    last_name, CONCAT(last_name,first_name), LENGTH(last_name), INSTR(last_name,'s')
FROM
    employees
WHERE
    SUBSTR(last_name, 2, 2) = 'ar';
#+end_src

Dando como resultado la tabla:

| last_name | CONCAT(last_name,first_name) | LENGTH(last_name) | INSTR(last_name,'s') |
|-----------+------------------------------+-------------------+----------------------|
| Marke     | MarkeSteven                  |                 6 |                    0 |
| Hartstein | HartsteinMichael             |                 9 |                    5 |
| Vargas    | VargasPeter                  |                 6 |                    6 |

** Funciones Númericas
| Función           | Resultado |
|-------------------+-----------|
| =ROUND(45.926,2)= |     45,93 |
| =TRUNC(45.926,2)= |     45.92 |
| =MOD(1600, 300)=  |       100 |
** Trabajando con Fechas
- Oracle almacena las fechas internamente en un formato númerico: siglo, año, mes, día, horas, minutos, segundos.
- El formato por defecto en México es =DD/MM/YY=.
- =SYSDATE= es una función que retorna la fecha y hora de sistema.
- =DUAL= es una tabla comodín que se usa para ver =SYSDATE=.
*** Usando Funciones de Fecha

| Función                                  | Resultado   |
|------------------------------------------+-------------|
| =MONTHS_BETWEEN('01/09/95', '11/01/94')= | 19.6774194  |
| =ADD_MONTHS('11/01/94',6)=               | '11-JUL-94' |
| =NEXT_DAY('01/09/95','Viernes')=         | '08-SEP-95' |
| =LAST_DAY('01/09/95')=                   | '30-SEP-95' |
| =ROUND(TO_DATE('25/07/95'),'MONTH')=     | '01/08/95'  |
| =ROUND(TO_DATE('25/07/95'),'YEAR')=      | '01/01/96'  |
| =TRUNC(TO_DATE('25/07/95'),'MONTH')=     | '01/07/96'  |
| =TRUNC(TO_DATE('25/07/95'),'YEAR')=      | '01/01/95'  |

*Nota*: Se debe de escribir en inglés el segundo argumento.
** Conversión Implicita de Tipos de Datos
En asignaciones, Oracle puede convertir automáticamente.
| De              | A        |
|-----------------+----------|
| VARCHAR2 o CHAR | NUMERO   |
| VARCHAR2 o CHAR | FECHA    |
| NUMERO          | VARCHAR2 |
| FECHA           | VARCHAR2 |

En evaluación de expresiones, Oracle puede convertir automáticamente.
| De              | A      |
|-----------------+--------|
| VARCHAR2 o CHAR | NUMERO |
| VARCHAR2 o CHAR | FECHA  |

** Función TO_CHAR con Fechas
=TO_CHAR(fecha, 'formato')=
- El modelo de formato debe ser encerrado entre comillas simples y es sensible a Mayúsculas.
- Puede Incluir cualquier elemento de formato válido de fecha.
- Puede utilizarse un *Fm* para remover blancos o ceros a la izquerda.
*** Modelos de formato para fechas
| Modelo de formato | Significado                                |
|-------------------+--------------------------------------------|
| YYYY              | Año completo con números                   |
| YEAR              | Año completo en palabras                   |
| MM                | Mes en número                              |
| MONTH             | Nombre completo del mes                    |
| D                 | Día númerico                               |
| DY                | Abreviación de 3 letras del nombre del día |
| DAY               | Nombre completo del día de la semana       |

*** Ejemplos de formato
| Modelo          | resultado     |
|-----------------+---------------|
| =HH24:MI:SS AM= | 15:45:32 AM   |
| =DD "de" MONTH= | 12 de Octubre |
| =ddspth=        | fourteenth    |

*** Ejemplo de uso
#+begin_src sql
SELECT
    last_name,
    TO_CHAR(hire_date, 'DD Month YYYY') AS "Fecha de contratación"
FROM
    employees;
#+end_src

daria resultado a:

| last_name | Fecha de contratación |
|-----------+-----------------------|
| Grant     | 13 Enero 2000         |
| Whalen    | 17 Septiembre 1987    |

** Función TO_CHAR con Números
=TO_CHAR(número, 'formato')=

Se usan las siguientes tablas de formato:

| =9= | Representa un número          |
| =0= | Fuerza un cero                |
| =$= | Muestra un signo de dólar     |
| =.= | Imprime un punto              |
| =,= | Imprime un indicador de miles |

