Publ/Lenguajes/SQL.html
<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name, CONCAT(last_name,first_name), <span style="color: #81A1C1; font-style: italic;">LENGTH</span>(last_name), INSTR(last_name,<span style="color: #A3BE8C;">'s'</span>)
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    SUBSTR(last_name, <span style="color: #B48EAD; font-weight: bold;">2</span>, <span style="color: #B48EAD; font-weight: bold;">2</span>) = <span style="color: #A3BE8C;">'ar'</span>;
</pre>
</div>

<p>
Dando como resultado la tabla:
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">last<sub>name</sub></th>
<th scope="col" class="text-left">CONCAT(last<sub>name,first</sub><sub>name</sub>)</th>
<th scope="col" class="text-right">LENGTH(last<sub>name</sub>)</th>
<th scope="col" class="text-right">INSTR(last<sub>name</sub>,&rsquo;s&rsquo;)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Marke</td>
<td class="text-left">MarkeSteven</td>
<td class="text-right">6</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Hartstein</td>
<td class="text-left">HartsteinMichael</td>
<td class="text-right">9</td>
<td class="text-right">5</td>
</tr>

<tr>
<td class="text-left">Vargas</td>
<td class="text-left">VargasPeter</td>
<td class="text-right">6</td>
<td class="text-right">6</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Funciones Númericas</h3>
<div class="outline-text-3" id="text-4-3">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Función</th>
<th scope="col" class="text-right">Resultado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left"><code>ROUND(45.926,2)</code></td>
<td class="text-right">45,93</td>
</tr>

<tr>
<td class="text-left"><code>TRUNC(45.926,2)</code></td>
<td class="text-right">45.92</td>
</tr>

<tr>
<td class="text-left"><code>MOD(1600, 300)</code></td>
<td class="text-right">100</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Trabajando con Fechas</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Oracle almacena las fechas internamente en un formato númerico: siglo, año, mes, día, horas, minutos, segundos.
</li>
<li>El formato por defecto en México es <code>DD/MM/YY</code>.
</li>
<li><code>SYSDATE</code> es una función que retorna la fecha y hora de sistema.
</li>
<li><code>DUAL</code> es una tabla comodín que se usa para ver <code>SYSDATE</code>.
</li>
</ul>
</div>
<div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Usando Funciones de Fecha</h4>
<div class="outline-text-4" id="text-4-4-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Función</th>
<th scope="col" class="text-left">Resultado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left"><code>MONTHS_BETWEEN('01/09/95', '11/01/94')</code></td>
<td class="text-left">19.6774194</td>
</tr>

<tr>
<td class="text-left"><code>ADD_MONTHS('11/01/94',6)</code></td>
<td class="text-left">&rsquo;11-JUL-94&rsquo;</td>
</tr>

<tr>
<td class="text-left"><code>NEXT_DAY('01/09/95','Viernes')</code></td>
<td class="text-left">&rsquo;08-SEP-95&rsquo;</td>
</tr>

<tr>
<td class="text-left"><code>LAST_DAY('01/09/95')</code></td>
<td class="text-left">&rsquo;30-SEP-95&rsquo;</td>
</tr>

<tr>
<td class="text-left"><code>ROUND(TO_DATE('25/07/95'),'MONTH')</code></td>
<td class="text-left">&rsquo;01/08/95&rsquo;</td>
</tr>

<tr>
<td class="text-left"><code>ROUND(TO_DATE('25/07/95'),'YEAR')</code></td>
<td class="text-left">&rsquo;01/01/96&rsquo;</td>
</tr>

<tr>
<td class="text-left"><code>TRUNC(TO_DATE('25/07/95'),'MONTH')</code></td>
<td class="text-left">&rsquo;01/07/96&rsquo;</td>
</tr>

<tr>
<td class="text-left"><code>TRUNC(TO_DATE('25/07/95'),'YEAR')</code></td>
<td class="text-left">&rsquo;01/01/95&rsquo;</td>
</tr>
</tbody>
</table>

<p>
<b>Nota</b>: Se debe de escribir en inglés el segundo argumento.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Conversión Implicita de Tipos de Datos</h3>
<div class="outline-text-3" id="text-4-5">
<p>
En asignaciones, Oracle puede convertir automáticamente.
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">De</th>
<th scope="col" class="text-left">A</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">VARCHAR2 o CHAR</td>
<td class="text-left">NUMERO</td>
</tr>

<tr>
<td class="text-left">VARCHAR2 o CHAR</td>
<td class="text-left">FECHA</td>
</tr>

<tr>
<td class="text-left">NUMERO</td>
<td class="text-left">VARCHAR2</td>
</tr>

<tr>
<td class="text-left">FECHA</td>
<td class="text-left">VARCHAR2</td>
</tr>
</tbody>
</table>

<p>
En evaluación de expresiones, Oracle puede convertir automáticamente.
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">De</th>
<th scope="col" class="text-left">A</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">VARCHAR2 o CHAR</td>
<td class="text-left">NUMERO</td>
</tr>

<tr>
<td class="text-left">VARCHAR2 o CHAR</td>
<td class="text-left">FECHA</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Función TO<sub>CHAR</sub> con Fechas</h3>
<div class="outline-text-3" id="text-4-6">
<p>
<code>TO_CHAR(fecha, 'formato')</code>
</p>
<ul class="org-ul">
<li>El modelo de formato debe ser encerrado entre comillas simples y es sensible a Mayúsculas.
</li>
<li>Puede Incluir cualquier elemento de formato válido de fecha.
</li>
<li>Puede utilizarse un <b>Fm</b> para remover blancos o ceros a la izquerda.
</li>
</ul>
</div>
<div id="outline-container-sec-4-6-1" class="outline-4">
<h4 id="sec-4-6-1"><span class="section-number-4">4.6.1</span> Modelos de formato para fechas</h4>
<div class="outline-text-4" id="text-4-6-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Modelo de formato</th>
<th scope="col" class="text-left">Significado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">YYYY</td>
<td class="text-left">Año completo con números</td>
</tr>

<tr>
<td class="text-left">YEAR</td>
<td class="text-left">Año completo en palabras</td>
</tr>

<tr>
<td class="text-left">MM</td>
<td class="text-left">Mes en número</td>
</tr>

<tr>
<td class="text-left">MONTH</td>
<td class="text-left">Nombre completo del mes</td>
</tr>

<tr>
<td class="text-left">D</td>
<td class="text-left">Día númerico</td>
</tr>

<tr>
<td class="text-left">DY</td>
<td class="text-left">Abreviación de 3 letras del nombre del día</td>
</tr>

<tr>
<td class="text-left">DAY</td>
<td class="text-left">Nombre completo del día de la semana</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4-6-2" class="outline-4">
<h4 id="sec-4-6-2"><span class="section-number-4">4.6.2</span> Ejemplos de formato</h4>
<div class="outline-text-4" id="text-4-6-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Modelo</th>
<th scope="col" class="text-left">resultado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left"><code>HH24:MI:SS AM</code></td>
<td class="text-left">15:45:32 AM</td>
</tr>

<tr>
<td class="text-left"><code>DD "de" MONTH</code></td>
<td class="text-left">12 de Octubre</td>
</tr>

<tr>
<td class="text-left"><code>ddspth</code></td>
<td class="text-left">fourteenth</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4-6-3" class="outline-4">
<h4 id="sec-4-6-3"><span class="section-number-4">4.6.3</span> Ejemplo de uso</h4>
<div class="outline-text-4" id="text-4-6-3">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name,
    TO_CHAR(hire_date, <span style="color: #A3BE8C;">'DD Month YYYY'</span>) <span style="color: #81A1C1; font-style: italic;">AS</span> "Fecha de contrataci&#243;n"
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees;
</pre>
</div>

<p>
daria resultado a:
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">last<sub>name</sub></th>
<th scope="col" class="text-left">Fecha de contratación</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Grant</td>
<td class="text-left">13 Enero 2000</td>
</tr>

<tr>
<td class="text-left">Whalen</td>
<td class="text-left">17 Septiembre 1987</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Función TO<sub>CHAR</sub> con Números</h3>
<div class="outline-text-3" id="text-4-7">
<p>
<code>TO_CHAR(número, 'formato')</code>
</p>

<p>
Se usan las siguientes tablas de formato:
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left"><code>9</code></td>
<td class="text-left">Representa un número</td>
</tr>

<tr>
<td class="text-left"><code>0</code></td>
<td class="text-left">Fuerza un cero</td>
</tr>

<tr>
<td class="text-left"><code>$</code></td>
<td class="text-left">Muestra un signo de dólar</td>
</tr>

<tr>
<td class="text-left"><code>.</code></td>
<td class="text-left">Imprime un punto</td>
</tr>

<tr>
<td class="text-left"><code>,</code></td>
<td class="text-left">Imprime un indicador de miles</td>
</tr>
</tbody>
</table>
</div>
