Files/Lenguajes/SQL.org
*** Ejemplo
#+begin_src sql
SELECT
    first_name,
    TO_CHAR(salary, '$99,999') fmt_salary
FROM
    employees
WHERE
    UPPER(last_name) = 'KING';
#+end_src

| first_name | salary | fmt_salary |
|------------+--------+------------|
| Steven     |  24000 | $24,000    |
| Janette    |  10000 | $10,000    |

*** Funciones =TO_NUMBER= y =TO_DATE=
- Se usa la función =TO_NUMBER= para convertir cadenas de caracteres a números con formato.
  + =TO_NUMBER(caracter)=
- Se usa la función =TO_DATE= para convertir cadenas de caracteres a fecha con formato.
  + =TO_DATE(caracter[, 'modelo de fomato'])=
** Función NVL
Convierte de un valor nulo a uno válido.
- Se puede usar con fecha, carácter y número.
- Los tipos de dato deben coincidir.

*** Ejemplo
#+begin_src sql
SELECT
    last_name,
    salary,
    commision_pct,
    (salary*12) + NVL(commision_pct*salary,0) AS "NVL",
    (salary*12) + (commision_pct*salary) "NULL"
From
    employees;
#+end_src

Que daria como resultado:

#+CAPTION: Si no nos encargamos de los valores nulos, nuestra operación da valor nulo.
| last_name | salary | commision_pct |   NVL |  NULL |
|-----------+--------+---------------+-------+-------|
| Grant     |   7000 |           .15 | 85050 | 85050 |
| Jhonson   |   6200 |            .1 | 75020 | 75020 |
| Taylor    |   3200 |               | 38400 |       |
| Fleaur    |   3100 |               | 37200 |       |

** Función DECODE
Facilita condiciones haciendo el trabajo de un =IF-THEN-ELSE=.
#+begin_src sql
DECODE (columna/expresión, condición 1, resultado 1
                           [condición 2, resultado 2, ...
                           , default])
#+end_src

*** Ejemplo
Con la consulta:
#+begin_src sql
SELECT
    job_id,
    salary,
    DECODE (SUBSTR(job_id, 4, 3),   'MAN', salary*1.20,
                                    'CLE', salary*1.15,
                                    'REP', salary*1.10,
                                           salary) AS "Salario Ajustado"
FROM
    employees;
#+end_src

Obtenemos la tabla:
| job_id   | salary | Salario Ajustado |
|----------+--------+------------------|
| SH_CLERK |   2600 |             2990 |
| AD_ASST  |   4400 |             4400 |
| MK_MAN   |  13000 |            15600 |
| HR_REP   |   6000 |             6600 |
| AC_MGR   |  12000 |            12000 |

** Anidando Funciones
- Las funciones sobre filas individuales pueden ser anidadas a cualquier nivel.
- Las funciones anidadas son evaluadas del nivel más interno al más externo.
  + =F3(F2(F1(col,arg1),arg2),arg3)=
* DML: Obtieniendo Información de Múltiples Tablas
** ¿Qué es una reunión? (JOIN)
- Se usa para consultar información de múltiples tablas.
- La condición de reunión se escribe en la clausula =WHERE=.
- El número de condiciones depende de dos cosas:
  + El número de tablas listadas en la clausula =FROM=
  + De los atributos en común que tengan las tablas.
- Si las tablas solo tienen un solo atributo en común las condiciones dependen del número de tablas.
  + Sea $n$ el numero de de tablas en la clausula =FROM=.
  + El número de condiciones de reunión serán $n-1$.

Ejemplo:
#+begin_src sql
SELECT
    tabla1.columna1,
    tabla2.columna1
FROM
    tabla1, tabla2
WHERE
    tabla1.columna_comun = tabla2.columna_comun;
#+end_src

*** Producto cartesiano
Se forma cuando:
- Se omite la condición de reunión.
- La condición de reunión es inválida.
- Todas las filas de la primer tabla se reúnen con todas las filas de la segunda tabla.

Para evitar un producto cartesiano, siempre se debe incluir una condición de reunión valida
en el =WHERE=.
**** Ejemplo
Si generamos un producto cartesiano de las tablas employees.last_name (107 Filas) y departmens.department_name (27 Filas)
Obtenemos una tabla resultante con 2849 filas ya que $107 \cdot 27 = 2849$, dando una consulta seguramente incorrecta.
** Tipos de reuniones
*** Equi join
Unimos dos tablas con un operador de igualdad, retornando solo las filas que coinciden en ambas tablas.
#+begin_src sql
SELECT
    E.employee_id,
    E.last_name,
    E.department_id,
    D.department_name,
    D.location
FROM
    employees E, departments D
WHERE
    E.department_id = D.department_id;
#+end_src

