Publ/Lenguajes/SQL.html

<div id="outline-container-sec-4-7-1" class="outline-4">
<h4 id="sec-4-7-1"><span class="section-number-4">4.7.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-4-7-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    first_name,
    TO_CHAR(salary, <span style="color: #A3BE8C;">'$99,999'</span>) fmt_salary
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    <span style="color: #81A1C1;">UPPER</span>(last_name) = <span style="color: #A3BE8C;">'KING'</span>;
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">first<sub>name</sub></th>
<th scope="col" class="text-right">salary</th>
<th scope="col" class="text-left">fmt<sub>salary</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Steven</td>
<td class="text-right">24000</td>
<td class="text-left">$24,000</td>
</tr>

<tr>
<td class="text-left">Janette</td>
<td class="text-right">10000</td>
<td class="text-left">$10,000</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4-7-2" class="outline-4">
<h4 id="sec-4-7-2"><span class="section-number-4">4.7.2</span> Funciones <code>TO_NUMBER</code> y <code>TO_DATE</code></h4>
<div class="outline-text-4" id="text-4-7-2">
<ul class="org-ul">
<li>Se usa la función <code>TO_NUMBER</code> para convertir cadenas de caracteres a números con formato.
<ul class="org-ul">
<li><code>TO_NUMBER(caracter)</code>
</li>
</ul>
</li>
<li>Se usa la función <code>TO_DATE</code> para convertir cadenas de caracteres a fecha con formato.
<ul class="org-ul">
<li><code>TO_DATE(caracter[, 'modelo de fomato'])</code>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> Función NVL</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Convierte de un valor nulo a uno válido.
</p>
<ul class="org-ul">
<li>Se puede usar con fecha, carácter y número.
</li>
<li>Los tipos de dato deben coincidir.
</li>
</ul>
</div>

<div id="outline-container-sec-4-8-1" class="outline-4">
<h4 id="sec-4-8-1"><span class="section-number-4">4.8.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-4-8-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name,
    salary,
    commision_pct,
    (salary*<span style="color: #B48EAD; font-weight: bold;">12</span>) + NVL(commision_pct*salary,<span style="color: #B48EAD; font-weight: bold;">0</span>) <span style="color: #81A1C1; font-style: italic;">AS</span> "NVL",
    (salary*<span style="color: #B48EAD; font-weight: bold;">12</span>) + (commision_pct*salary) "<span style="color: #81A1C1; font-style: italic;">NULL</span>"
<span style="color: #81A1C1; font-style: italic;">From</span>
    employees;
</pre>
</div>

<p>
Que daria como resultado:
</p>

<table class="table table-striped table-bordered table-hover table-condensed">
<caption class="t-above"><span class="table-number">Table 1:</span> Si no nos encargamos de los valores nulos, nuestra operación da valor nulo.</caption>

<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">last<sub>name</sub></th>
<th scope="col" class="text-right">salary</th>
<th scope="col" class="text-right">commision<sub>pct</sub></th>
<th scope="col" class="text-right">NVL</th>
<th scope="col" class="text-right">NULL</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Grant</td>
<td class="text-right">7000</td>
<td class="text-right">.15</td>
<td class="text-right">85050</td>
<td class="text-right">85050</td>
</tr>

<tr>
<td class="text-left">Jhonson</td>
<td class="text-right">6200</td>
<td class="text-right">.1</td>
<td class="text-right">75020</td>
<td class="text-right">75020</td>
</tr>

<tr>
<td class="text-left">Taylor</td>
<td class="text-right">3200</td>
<td class="text-right">&#xa0;</td>
<td class="text-right">38400</td>
<td class="text-right">&#xa0;</td>
</tr>

<tr>
<td class="text-left">Fleaur</td>
<td class="text-right">3100</td>
<td class="text-right">&#xa0;</td>
<td class="text-right">37200</td>
<td class="text-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> Función DECODE</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Facilita condiciones haciendo el trabajo de un <code>IF-THEN-ELSE</code>.
</p>
<div class="org-src-container">

<pre class="src src-sql">DECODE (columna/expresi&#243;n, condici&#243;n <span style="color: #B48EAD; font-weight: bold;">1</span>, resultado <span style="color: #B48EAD; font-weight: bold;">1</span>
                           [condici&#243;n <span style="color: #B48EAD; font-weight: bold;">2</span>, resultado <span style="color: #B48EAD; font-weight: bold;">2</span>, ...
                           , <span style="color: #81A1C1; font-style: italic;">default</span>])
</pre>
</div>
</div>

<div id="outline-container-sec-4-9-1" class="outline-4">
<h4 id="sec-4-9-1"><span class="section-number-4">4.9.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-4-9-1">
<p>
Con la consulta:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    job_id,
    salary,
    DECODE (SUBSTR(job_id, <span style="color: #B48EAD; font-weight: bold;">4</span>, <span style="color: #B48EAD; font-weight: bold;">3</span>),   <span style="color: #A3BE8C;">'MAN'</span>, salary*<span style="color: #B48EAD; font-weight: bold;">1.20</span>,
                                    <span style="color: #A3BE8C;">'CLE'</span>, salary*<span style="color: #B48EAD; font-weight: bold;">1.15</span>,
                                    <span style="color: #A3BE8C;">'REP'</span>, salary*<span style="color: #B48EAD; font-weight: bold;">1.10</span>,
                                           salary) <span style="color: #81A1C1; font-style: italic;">AS</span> "Salario Ajustado"
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees;
</pre>
</div>

<p>
Obtenemos la tabla:
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">job<sub>id</sub></th>
<th scope="col" class="text-right">salary</th>
<th scope="col" class="text-right">Salario Ajustado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">SH<sub>CLERK</sub></td>
<td class="text-right">2600</td>
<td class="text-right">2990</td>
</tr>

<tr>
<td class="text-left">AD<sub>ASST</sub></td>
<td class="text-right">4400</td>
<td class="text-right">4400</td>
</tr>

<tr>
<td class="text-left">MK<sub>MAN</sub></td>
<td class="text-right">13000</td>
<td class="text-right">15600</td>
</tr>

<tr>
<td class="text-left">HR<sub>REP</sub></td>
<td class="text-right">6000</td>
<td class="text-right">6600</td>
</tr>

<tr>
<td class="text-left">AC<sub>MGR</sub></td>
<td class="text-right">12000</td>
<td class="text-right">12000</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> Anidando Funciones</h3>
<div class="outline-text-3" id="text-4-10">
<ul class="org-ul">
<li>Las funciones sobre filas individuales pueden ser anidadas a cualquier nivel.
</li>
<li>Las funciones anidadas son evaluadas del nivel más interno al más externo.
<ul class="org-ul">
<li><code>F3(F2(F1(col,arg1),arg2),arg3)</code>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> DML: Obtieniendo Información de Múltiples Tablas</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> ¿Qué es una reunión? (JOIN)</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Se usa para consultar información de múltiples tablas.
</li>
<li>La condición de reunión se escribe en la clausula <code>WHERE</code>.
</li>
<li>El número de condiciones depende de dos cosas:
<ul class="org-ul">
<li>El número de tablas listadas en la clausula <code>FROM</code>
</li>
<li>De los atributos en común que tengan las tablas.
</li>
</ul>
</li>
<li>Si las tablas solo tienen un solo atributo en común las condiciones dependen del número de tablas.
<ul class="org-ul">
<li>Sea \(n\) el numero de de tablas en la clausula <code>FROM</code>.
</li>
<li>El número de condiciones de reunión serán \(n-1\).
</li>
</ul>
</li>
</ul>

<p>
Ejemplo:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    tabla1.columna1,
    tabla2.columna1
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    tabla1, tabla2
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    tabla1.columna_comun = tabla2.columna_comun;
</pre>
</div>
</div>

<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Producto cartesiano</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Se forma cuando:
</p>
<ul class="org-ul">
<li>Se omite la condición de reunión.
</li>
<li>La condición de reunión es inválida.
</li>
<li>Todas las filas de la primer tabla se reúnen con todas las filas de la segunda tabla.
</li>
</ul>

<p>
Para evitar un producto cartesiano, siempre se debe incluir una condición de reunión valida
en el <code>WHERE</code>.
</p>
</div>
<ol class="org-ol"><li><a id="sec-5-1-1-1" name="sec-5-1-1-1"></a>Ejemplo<br ><div class="outline-text-5" id="text-5-1-1-1">
<p>
Si generamos un producto cartesiano de las tablas employees.last<sub>name</sub> (107 Filas) y departmens.department<sub>name</sub> (27 Filas)
Obtenemos una tabla resultante con 2849 filas ya que \(107 \cdot 27 = 2849\), dando una consulta seguramente incorrecta.
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Tipos de reuniones</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Equi join</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
Unimos dos tablas con un operador de igualdad, retornando solo las filas que coinciden en ambas tablas.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    E.employee_id,
    E.last_name,
    E.department_id,
    D.department_name,
    D.location
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees E, departments D
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    E.department_id = D.department_id;
</pre>
</div>
</div>
