Files/Lenguajes/SQL.org
**** Uniendo más de dos tablas
#+begin_src sql
SELECT
    E.employee_id,
    E.last_name,
    E.department_id,
    D.department_name,
    D.location_id,
    L.city
FROM
    employees E, departmens D, locations L
WHERE
    E.department_id = D.department_id
    AND D.location_id = L.location_id;
#+end_src

*** Non-equi join
Usan operadores de comparación en lugar de los operadores de igualdad, además de condiciones.
#+begin_src sql
SELECT
    E.last_name,
    E.salary,
    S.grade
FROM
    employees E, salary_grades S
WHERE
    E.salary BETWEEN S.low AND S.high;
#+end_src

*** Outer join
Se usan para ver las filas que usualmente no se muestran con las condiciones de reunión (Como valores nulos).
- El simbolo del Outher join en oracle es (+), En otros manejadores puede ser *.
#+begin_src sql
SELECT
    table1.column,
    table1.column
FROM
    table1, table2
WHERE
    table1.column(+) = table2.column;
#+end_src

*** Self join
Se usan para unir una tabla con ella misma, usando alias diferentes.
#+begin_src sql
SELECT
    E.last_name||' tabaja para '||J.last_name
FROM
    employees E, employees J
WHERE
    E.manager_id = J.manager_id;
#+end_src

* DML: Funciones de Agregación
** Funciones de grupo
Operan en un conjunto de filas para dar resultados por grupo.
- Las funciones =MIN= y =MAX= pueden usarse con cualquer tipo de dato.
- Las funciones de grupo ignoran los valores nulos, por lo que es necesario el uso de la función =NVL=.

Funciones de grupo:
- =COUNT= : Cuenta los elementos.
- =MAX= : El máximo elemento.
- =MIN= : El mínimo elemento.
- =AVG= : Promedio.
- =VARIANCE= : Varianza.
- =STDDEV= : Desviación estándar.
** Funciones con Argumentos Númericos
Las funciones =AVR=, =SUM=, =MAX=, y =MIN= se pueden usar para datos númericos.

#+begin_src sql
SELECT
    AVR(salary),
    SUM(salary),
    MAX(salary),
    MIN(salary)
FROM
    employees;
#+end_src

** Función COUNT
=COUNT(*)= Retorna el número de filas de una columna.
#+begin_src sql
SELECT
    COUNT(*)
FROM
    employees;
#+end_src

Podemos contar los valores únicos.
#+begin_src sql
SELECT
    COUNT(DISTINCT last_name)
FROM
    employees;
#+end_src

** Creando grupos de datos
Podemos dividir las filas de una columna en grupos más pequeños con la cláusula =GROUP BY=.
- Si incluyes una función de grupo en la cláusula =SELECT=, *no* puedes seleccionar los resultados
  individuales, a menos que la columna individual aparezca en la cláusula =GROUP BY=, de lo contrario
  obtendras un error.
- Usa la cláusula =WHERE= para pre-excluir las filas que no necesites, antes de crear los grupos.
- No se pueden usar los alias de las columnas en la cláusula =GROUP BY=.
- Se pueden ordenar las columnas con la cáusula =ORDER BY=, que siempre debe de ser la última cáusula.
*** Ejemplo
#+begin_src sql
SELECT
    departments_id,
    AVG(salary)
FROM
    employees
GROUP BY
    department_id;
#+end_src
También es posible agrupar usando multiples columnas.

*** Consultas Ilegales
- Cualquier columna o expreción en la lista del =SELECT=, que no se encuentre en una función de grupo,
  debe de ir en la lista =GROUP BY=
- No puedes usar la cláusula =WHERE= para filtrar grupos, en ese caso debes de usar la cláusula =HAVING=.
*** Cláusula HAVING
Los grupos que coincidan con la condición =HAVING= serán mostrados.
#+begin_src sql
-- Estructura --
SELECT
    column, función_de_grupo(column)
FROM
    table
[WHERE
    condition]
[GROUP BY
    agrupar_por_expresión]
[HAVING
    condición]
[ORDER BY
    column]
#+end_src

**** Ejemplo
#+begin_src sql
SELECT
    department_name AS "Departamento",
    sum(salary) AS "Nomina Total"
FROM
    employees E, departments D
WHERE
    E.department_id = D.department_id
GROUP BY
    department_name
HAVING
    sum(salary) < 1500
ORDER BY
    "Nomina Total";
#+end_src

* DML: Subconsultas
Permiten ejecutar una consulta más pequeña dentro de una consulta.

Guia para el uso de las subconsultas:
- Siempre deben de ir encerradas entre parentesís.
- Se deben de ubicar el lado *derecho* del operador de comparación.
- No agregar la cláusula =ORDER BY= dentro de una subconsulta.
- Usar operadores sobre filas individuales con subconsultas que regresen filas individuales.
- Usar operadores sobre múltiples filas con subconsultas que regresen múltiples filas.
** Subconsultas de Una Sola Fila
- Regresan una sola fila.
- Usan operadores de comparación sobre filas individuales.
