Publ/Lenguajes/SQL.html

<ol class="org-ol"><li><a id="sec-5-2-1-1" name="sec-5-2-1-1"></a>Uniendo más de dos tablas<br ><div class="outline-text-5" id="text-5-2-1-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    E.employee_id,
    E.last_name,
    E.department_id,
    D.department_name,
    D.location_id,
    L.city
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees E, departmens D, locations L
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    E.department_id = D.department_id
    <span style="color: #81A1C1; font-style: italic;">AND</span> D.location_id = L.location_id;
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> Non-equi join</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
Usan operadores de comparación en lugar de los operadores de igualdad, además de condiciones.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    E.last_name,
    E.salary,
    S.grade
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees E, salary_grades S
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    E.salary <span style="color: #81A1C1; font-style: italic;">BETWEEN</span> S.low <span style="color: #81A1C1; font-style: italic;">AND</span> S.high;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> Outer join</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
Se usan para ver las filas que usualmente no se muestran con las condiciones de reunión (Como valores nulos).
</p>
<ul class="org-ul">
<li>El simbolo del Outher join en oracle es (+), En otros manejadores puede ser *.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    table1.<span style="color: #81A1C1; font-style: italic;">column</span>,
    table1.<span style="color: #81A1C1; font-style: italic;">column</span>
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    table1, table2
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    table1.<span style="color: #81A1C1; font-style: italic;">column</span>(+) = table2.<span style="color: #81A1C1; font-style: italic;">column</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4"><span class="section-number-4">5.2.4</span> Self join</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
Se usan para unir una tabla con ella misma, usando alias diferentes.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    E.last_name||<span style="color: #A3BE8C;">' tabaja para '</span>||J.last_name
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees E, employees J
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    E.manager_id = J.manager_id;
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> DML: Funciones de Agregación</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Funciones de grupo</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Operan en un conjunto de filas para dar resultados por grupo.
</p>
<ul class="org-ul">
<li>Las funciones <code>MIN</code> y <code>MAX</code> pueden usarse con cualquer tipo de dato.
</li>
<li>Las funciones de grupo ignoran los valores nulos, por lo que es necesario el uso de la función <code>NVL</code>.
</li>
</ul>

<p>
Funciones de grupo:
</p>
<ul class="org-ul">
<li><code>COUNT</code> : Cuenta los elementos.
</li>
<li><code>MAX</code> : El máximo elemento.
</li>
<li><code>MIN</code> : El mínimo elemento.
</li>
<li><code>AVG</code> : Promedio.
</li>
<li><code>VARIANCE</code> : Varianza.
</li>
<li><code>STDDEV</code> : Desviación estándar.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Funciones con Argumentos Númericos</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Las funciones <code>AVR</code>, <code>SUM</code>, <code>MAX</code>, y <code>MIN</code> se pueden usar para datos númericos.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    AVR(salary),
    <span style="color: #81A1C1;">SUM</span>(salary),
    <span style="color: #81A1C1;">MAX</span>(salary),
    <span style="color: #81A1C1;">MIN</span>(salary)
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Función COUNT</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<code>COUNT(*)</code> Retorna el número de filas de una columna.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    <span style="color: #81A1C1;">COUNT</span>(*)
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees;
</pre>
</div>

<p>
Podemos contar los valores únicos.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    <span style="color: #81A1C1;">COUNT</span>(<span style="color: #81A1C1; font-style: italic;">DISTINCT</span> last_name)
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Creando grupos de datos</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Podemos dividir las filas de una columna en grupos más pequeños con la cláusula <code>GROUP BY</code>.
</p>
<ul class="org-ul">
<li>Si incluyes una función de grupo en la cláusula <code>SELECT</code>, <b>no</b> puedes seleccionar los resultados
individuales, a menos que la columna individual aparezca en la cláusula <code>GROUP BY</code>, de lo contrario
obtendras un error.
</li>
<li>Usa la cláusula <code>WHERE</code> para pre-excluir las filas que no necesites, antes de crear los grupos.
</li>
<li>No se pueden usar los alias de las columnas en la cláusula <code>GROUP BY</code>.
</li>
<li>Se pueden ordenar las columnas con la cáusula <code>ORDER BY</code>, que siempre debe de ser la última cáusula.
</li>
</ul>
</div>
<div id="outline-container-sec-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-6-4-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    departments_id,
    <span style="color: #81A1C1;">AVG</span>(salary)
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">GROUP</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
    department_id;
</pre>
</div>
<p>
También es posible agrupar usando multiples columnas.
</p>
</div>
</div>

<div id="outline-container-sec-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> Consultas Ilegales</h4>
<div class="outline-text-4" id="text-6-4-2">
<ul class="org-ul">
<li>Cualquier columna o expreción en la lista del <code>SELECT</code>, que no se encuentre en una función de grupo,
debe de ir en la lista <code>GROUP BY</code>
</li>
<li>No puedes usar la cláusula <code>WHERE</code> para filtrar grupos, en ese caso debes de usar la cláusula <code>HAVING</code>.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-4-3" class="outline-4">
<h4 id="sec-6-4-3"><span class="section-number-4">6.4.3</span> Cláusula HAVING</h4>
<div class="outline-text-4" id="text-6-4-3">
<p>
Los grupos que coincidan con la condición <code>HAVING</code> serán mostrados.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #6f7787; font-style: italic;">-- Estructura --</span>
<span style="color: #81A1C1; font-style: italic;">SELECT</span>
    <span style="color: #81A1C1; font-style: italic;">column</span>, funci&#243;n_de_grupo(<span style="color: #81A1C1; font-style: italic;">column</span>)
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    <span style="color: #81A1C1; font-style: italic;">table</span>
[<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    condition]
[<span style="color: #81A1C1; font-style: italic;">GROUP</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
    agrupar_por_expresi&#243;n]
[<span style="color: #81A1C1; font-style: italic;">HAVING</span>
    condici&#243;n]
[<span style="color: #81A1C1; font-style: italic;">ORDER</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
    <span style="color: #81A1C1; font-style: italic;">column</span>]
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="sec-6-4-3-1" name="sec-6-4-3-1"></a>Ejemplo<br ><div class="outline-text-5" id="text-6-4-3-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    department_name <span style="color: #81A1C1; font-style: italic;">AS</span> "Departamento",
    <span style="color: #81A1C1;">sum</span>(salary) <span style="color: #81A1C1; font-style: italic;">AS</span> "Nomina Total"
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees E, departments D
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    E.department_id = D.department_id
<span style="color: #81A1C1; font-style: italic;">GROUP</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
    department_name
<span style="color: #81A1C1; font-style: italic;">HAVING</span>
    <span style="color: #81A1C1;">sum</span>(salary) &lt; <span style="color: #B48EAD; font-weight: bold;">1500</span>
<span style="color: #81A1C1; font-style: italic;">ORDER</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
    "Nomina Total";
</pre>
</div>
</div>
</li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> DML: Subconsultas</h2>
<div class="outline-text-2" id="text-7">
<p>
Permiten ejecutar una consulta más pequeña dentro de una consulta.
</p>

<p>
Guia para el uso de las subconsultas:
</p>
<ul class="org-ul">
<li>Siempre deben de ir encerradas entre parentesís.
</li>
<li>Se deben de ubicar el lado <b>derecho</b> del operador de comparación.
</li>
<li>No agregar la cláusula <code>ORDER BY</code> dentro de una subconsulta.
</li>
<li>Usar operadores sobre filas individuales con subconsultas que regresen filas individuales.
</li>
<li>Usar operadores sobre múltiples filas con subconsultas que regresen múltiples filas.
</li>
</ul>
</div>
<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Subconsultas de Una Sola Fila</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Regresan una sola fila.
</li>
<li>Usan operadores de comparación sobre filas individuales.
</li>
</ul>
</div>
