Files/Lenguajes/SQL.org
*** Ejemplo
#+begin_src sql
SELECT
    last_name||' '||first_name AS "Empleado",
    job_id,
    salary
FROM
    employees
WHERE
    job_id =    (SELECT
                    job_id,
                FROM
                    employees
                WHERE
                    employee_id = 103)
    AND salary >    (SELECT
                        salary
                    FROM
                        employees
                    WHERE
                        employee_id = 203);
#+end_src

** Subconsultas de Múltiples filas
- Regresan más de una sola fila.
- Usan comparaciones de comparación sobre múltiples filas.

Operadores de comparación en Múltiples columas:
| Operador | Descripción                                                          |
|----------+----------------------------------------------------------------------|
| =IN=     | Igual a cualquer elemento de la lista                                |
| =ANY=    | Compara el valor con cada uno de los valores que retorna la consulta |
| =ALL=    | Compara el valor con todos los valores dados por la subconsulta      |

*** Ejemplo
#+begin_src sql
SELECT
    employee_id,
    last_name,
    job_id,
    salary
FROM
    employees
WHERE
    salary < ANY (
                SELECT
                    salary
                FROM
                    employees
                WHERE
                    job_id LIKE '%_REP')
    AND job_id NOT LIKE '%_REP'
ORDER BY
    salary;
#+end_src

** Subconsultas de múltiples columnas
La consulta principal compara con los valores de una subconsulta que devuelve múltiples filas y
columas.
*** Ejemplo
Muestra el apellido, la fecha de contratación, el salario y el número de departamento de cualquier
empleado que coincida en fecha de contratación y salario con cualquier subordinado del empleado 100.

#+begin_src sql
SELECT
    last_name,
    hire_date,
    salary,
    department_id
FROM
    employees
WHERE
    (hire_date, salary) IN (SELECT
                                hire_date,
                                salary
                            FROM
                                employees
                            WHERE
                                manager_id=100)
ORDER BY
    last_name;
#+end_src

*** Subconsultas en la cáusula FROM
Se pueden hacer subconsultas en la cláusula =FROM=, esto lleva a la creación de una tabla temporal en el buffer.

#+begin_src sql
SELECT
    a.last_name,
    a.salary
    a.department_id,
    b.salavg
FROM
    employees a,    (SELECT
                        department_id,
                        AVG(salary) salavg
                    FROM
                        employees
                    GROUP BY
                        department_id) b
WHERE
    a.department_id = b.department_id
    AND a.salary > b.salavg;
#+end_src

* DML: Creando y Manipulando Objetos de la Base de Datos
** Creando una tabla usando consultas
Si el manejador tiene la opción de copiado masivo de datos (/Bulk Copy/),
es posible crear tablas (temporales o permanentes) al momento de realizar una consulta.
*** Ejemplo: Creando tablas permanentes
#+begin_src sql
SELECT
    * INTO depto100
FROM
    employees
WHERE
   department_id = 100;
#+end_src

*** Ejemplo: Creando tablas temporales
#+begin_src sql
SELECT
    ,* INTO #depto100
FROM
    employees
WHERE
    department_id = 100;
#+end_src

** Cereando una tabla usando Subconsultas
Una tabla puede ser llenada combinando la cláusula =CREATE TABLE= y una subconsulta.
- Si espeificas columas, debes de hacer coincidir el número de columas definidas
  con las columas regresadas por la subconsulta.
- Se definen nombres de consultas y valores
*** Ejemplo
#+begin_src sql
CREATE TABLE depto30 AS
    (SELECT
        employee_id empno,
        last_name,
        first_name
        salary*12 salanual,
        hire_date hiredate
    FROM
        employees
    WHERE
        department_id = 30);
#+end_src

** Vistas
Es un objeto de la Base de Datos que es una representación lógica de subconjuntos de
datos de una o más tablas.
*** ¿Por qué vistas?
- Para restringir el acceso a ciertos objetos de la base de datos.
- Para simplificar consultas complejas.
- Para permitir independencia de datos.
- Para personalizar la forma en que se muestran los mismos datos según la necesidad
  de cada tipo de usuario.
