Publ/Lenguajes/SQL.html
<div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-7-1-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name||<span style="color: #A3BE8C;">' '</span>||first_name <span style="color: #81A1C1; font-style: italic;">AS</span> "Empleado",
    job_id,
    salary
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    job_id =    (<span style="color: #81A1C1; font-style: italic;">SELECT</span>
                    job_id,
                <span style="color: #81A1C1; font-style: italic;">FROM</span>
                    employees
                <span style="color: #81A1C1; font-style: italic;">WHERE</span>
                    employee_id = <span style="color: #B48EAD; font-weight: bold;">103</span>)
    <span style="color: #81A1C1; font-style: italic;">AND</span> salary &gt;    (<span style="color: #81A1C1; font-style: italic;">SELECT</span>
                        salary
                    <span style="color: #81A1C1; font-style: italic;">FROM</span>
                        employees
                    <span style="color: #81A1C1; font-style: italic;">WHERE</span>
                        employee_id = <span style="color: #B48EAD; font-weight: bold;">203</span>);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Subconsultas de Múltiples filas</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Regresan más de una sola fila.
</li>
<li>Usan comparaciones de comparación sobre múltiples filas.
</li>
</ul>

<p>
Operadores de comparación en Múltiples columas:
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Operador</th>
<th scope="col" class="text-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left"><code>IN</code></td>
<td class="text-left">Igual a cualquer elemento de la lista</td>
</tr>

<tr>
<td class="text-left"><code>ANY</code></td>
<td class="text-left">Compara el valor con cada uno de los valores que retorna la consulta</td>
</tr>

<tr>
<td class="text-left"><code>ALL</code></td>
<td class="text-left">Compara el valor con todos los valores dados por la subconsulta</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-7-2-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    employee_id,
    last_name,
    job_id,
    salary
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    salary &lt; <span style="color: #81A1C1; font-style: italic;">ANY</span> (
                <span style="color: #81A1C1; font-style: italic;">SELECT</span>
                    salary
                <span style="color: #81A1C1; font-style: italic;">FROM</span>
                    employees
                <span style="color: #81A1C1; font-style: italic;">WHERE</span>
                    job_id <span style="color: #81A1C1; font-style: italic;">LIKE</span> <span style="color: #A3BE8C;">'%_REP'</span>)
    <span style="color: #81A1C1; font-style: italic;">AND</span> job_id <span style="color: #81A1C1; font-style: italic;">NOT</span> <span style="color: #81A1C1; font-style: italic;">LIKE</span> <span style="color: #A3BE8C;">'%_REP'</span>
<span style="color: #81A1C1; font-style: italic;">ORDER</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
    salary;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Subconsultas de múltiples columnas</h3>
<div class="outline-text-3" id="text-7-3">
<p>
La consulta principal compara con los valores de una subconsulta que devuelve múltiples filas y
columas.
</p>
</div>
<div id="outline-container-sec-7-3-1" class="outline-4">
<h4 id="sec-7-3-1"><span class="section-number-4">7.3.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
Muestra el apellido, la fecha de contratación, el salario y el número de departamento de cualquier
empleado que coincida en fecha de contratación y salario con cualquier subordinado del empleado 100.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    last_name,
    hire_date,
    salary,
    department_id
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    (hire_date, salary) <span style="color: #81A1C1; font-style: italic;">IN</span> (<span style="color: #81A1C1; font-style: italic;">SELECT</span>
                                hire_date,
                                salary
                            <span style="color: #81A1C1; font-style: italic;">FROM</span>
                                employees
                            <span style="color: #81A1C1; font-style: italic;">WHERE</span>
                                manager_id=<span style="color: #B48EAD; font-weight: bold;">100</span>)
<span style="color: #81A1C1; font-style: italic;">ORDER</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
    last_name;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-3-2" class="outline-4">
<h4 id="sec-7-3-2"><span class="section-number-4">7.3.2</span> Subconsultas en la cáusula FROM</h4>
<div class="outline-text-4" id="text-7-3-2">
<p>
Se pueden hacer subconsultas en la cláusula <code>FROM</code>, esto lleva a la creación de una tabla temporal en el buffer.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    a.last_name,
    a.salary
    a.department_id,
    b.salavg
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees a,    (<span style="color: #81A1C1; font-style: italic;">SELECT</span>
                        department_id,
                        <span style="color: #81A1C1;">AVG</span>(salary) salavg
                    <span style="color: #81A1C1; font-style: italic;">FROM</span>
                        employees
                    <span style="color: #81A1C1; font-style: italic;">GROUP</span> <span style="color: #81A1C1; font-style: italic;">BY</span>
                        department_id) b
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    a.department_id = b.department_id
    <span style="color: #81A1C1; font-style: italic;">AND</span> a.salary &gt; b.salavg;
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> DML: Creando y Manipulando Objetos de la Base de Datos</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Creando una tabla usando consultas</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Si el manejador tiene la opción de copiado masivo de datos (<i>Bulk Copy</i>),
es posible crear tablas (temporales o permanentes) al momento de realizar una consulta.
</p>
</div>
<div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> Ejemplo: Creando tablas permanentes</h4>
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    * <span style="color: #81A1C1; font-style: italic;">INTO</span> depto100
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
   department_id = <span style="color: #B48EAD; font-weight: bold;">100</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-1-2" class="outline-4">
<h4 id="sec-8-1-2"><span class="section-number-4">8.1.2</span> Ejemplo: Creando tablas temporales</h4>
<div class="outline-text-4" id="text-8-1-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">SELECT</span>
    * <span style="color: #81A1C1; font-style: italic;">INTO</span> #depto100
<span style="color: #81A1C1; font-style: italic;">FROM</span>
    employees
<span style="color: #81A1C1; font-style: italic;">WHERE</span>
    department_id = <span style="color: #B48EAD; font-weight: bold;">100</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Cereando una tabla usando Subconsultas</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Una tabla puede ser llenada combinando la cláusula <code>CREATE TABLE</code> y una subconsulta.
</p>
<ul class="org-ul">
<li>Si espeificas columas, debes de hacer coincidir el número de columas definidas
con las columas regresadas por la subconsulta.
</li>
<li>Se definen nombres de consultas y valores
</li>
</ul>
</div>
<div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> Ejemplo</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">CREATE</span> <span style="color: #81A1C1; font-style: italic;">TABLE</span> <span style="color: #8FBCBB;">depto30</span> <span style="color: #81A1C1; font-style: italic;">AS</span>
    (<span style="color: #81A1C1; font-style: italic;">SELECT</span>
        employee_id empno,
        last_name,
        first_name
        salary*<span style="color: #B48EAD; font-weight: bold;">12</span> salanual,
        hire_date hiredate
    <span style="color: #81A1C1; font-style: italic;">FROM</span>
        employees
    <span style="color: #81A1C1; font-style: italic;">WHERE</span>
        department_id = <span style="color: #B48EAD; font-weight: bold;">30</span>);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Vistas</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Es un objeto de la Base de Datos que es una representación lógica de subconjuntos de
datos de una o más tablas.
</p>
</div>
<div id="outline-container-sec-8-3-1" class="outline-4">
<h4 id="sec-8-3-1"><span class="section-number-4">8.3.1</span> ¿Por qué vistas?</h4>
<div class="outline-text-4" id="text-8-3-1">
<ul class="org-ul">
<li>Para restringir el acceso a ciertos objetos de la base de datos.
</li>
<li>Para simplificar consultas complejas.
</li>
<li>Para permitir independencia de datos.
</li>
<li>Para personalizar la forma en que se muestran los mismos datos según la necesidad
de cada tipo de usuario.
</li>
</ul>
</div>
</div>
