Files/Lenguajes/SQL.org
*** Estructura de las vistas
- Se incluye una subconsulta en el esta =CREATE VIEW=
- La subconsulta puede contener sintaxís compleja, incluyendo joins, subconsultas y grupos.
- La subconsulta *no* debe contener la cláusula =ORDER BY=.
#+begin_src sql
CREATE [OR REPLACE] [FORCE|NONFORCE] VIEW view
       [(alias[,alias]...)]
AS subconsulta
[WITH CHECK OPTION [CONSTRAINT restricción]]
[WITH READ ONLY]
#+end_src

*** Creando vistas
Crea una vista, EMPVU10, que contenga los detalles de los empleados del departamento 90.
#+begin_src sql
CREATE VIEW vw_emp90
AS
    SELECT
        employee_id,
        last_name,
        job_id
    FROM
        employees
    WHERE
        department_id = 90;
#+end_src

Puedes describir la estructura de la vista usando el comando =DESCRIBE=.
#+begin_src sql
DESCRIBE vw_emp90
#+end_src

*** Tipos de vistas
| caracteristicas          | vistas simples | vistas complejas |
|--------------------------+----------------+------------------|
| Número de tablas         | Una            | Una o más        |
| Contiene funciones       | No             | Si               |
| Contiene Grupos de datos | No             | Si               |
| DML a través de la vista | Si             | No siempre       |
*** Modificando una Vista
