Publ/Lenguajes/SQL.html
<div id="outline-container-sec-8-3-2" class="outline-4">
<h4 id="sec-8-3-2"><span class="section-number-4">8.3.2</span> Estructura de las vistas</h4>
<div class="outline-text-4" id="text-8-3-2">
<ul class="org-ul">
<li>Se incluye una subconsulta en el esta <code>CREATE VIEW</code>
</li>
<li>La subconsulta puede contener sintaxís compleja, incluyendo joins, subconsultas y grupos.
</li>
<li>La subconsulta <b>no</b> debe contener la cláusula <code>ORDER BY</code>.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">CREATE</span> [<span style="color: #81A1C1; font-style: italic;">OR</span> REPLACE] [FORCE|NONFORCE] <span style="color: #81A1C1; font-style: italic;">VIEW</span> <span style="color: #81A1C1; font-style: italic;">view</span>
       [(<span style="color: #81A1C1; font-style: italic;">alias</span>[,<span style="color: #81A1C1; font-style: italic;">alias</span>]...)]
<span style="color: #81A1C1; font-style: italic;">AS</span> subconsulta
[<span style="color: #81A1C1; font-style: italic;">WITH</span> <span style="color: #81A1C1; font-style: italic;">CHECK</span> <span style="color: #81A1C1; font-style: italic;">OPTION</span> [<span style="color: #81A1C1; font-style: italic;">CONSTRAINT</span> restricci&#243;n]]
[<span style="color: #81A1C1; font-style: italic;">WITH</span> <span style="color: #81A1C1; font-style: italic;">READ</span> <span style="color: #81A1C1; font-style: italic;">ONLY</span>]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3-3" class="outline-4">
<h4 id="sec-8-3-3"><span class="section-number-4">8.3.3</span> Creando vistas</h4>
<div class="outline-text-4" id="text-8-3-3">
<p>
Crea una vista, EMPVU10, que contenga los detalles de los empleados del departamento 90.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">CREATE</span> <span style="color: #81A1C1; font-style: italic;">VIEW</span> <span style="color: #8FBCBB;">vw_emp90</span>
<span style="color: #81A1C1; font-style: italic;">AS</span>
    <span style="color: #81A1C1; font-style: italic;">SELECT</span>
        employee_id,
        last_name,
        job_id
    <span style="color: #81A1C1; font-style: italic;">FROM</span>
        employees
    <span style="color: #81A1C1; font-style: italic;">WHERE</span>
        department_id = <span style="color: #B48EAD; font-weight: bold;">90</span>;
</pre>
</div>

<p>
Puedes describir la estructura de la vista usando el comando <code>DESCRIBE</code>.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #81A1C1; font-style: italic;">DESCRIBE</span> vw_emp90
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3-4" class="outline-4">
<h4 id="sec-8-3-4"><span class="section-number-4">8.3.4</span> Tipos de vistas</h4>
<div class="outline-text-4" id="text-8-3-4">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">caracteristicas</th>
<th scope="col" class="text-left">vistas simples</th>
<th scope="col" class="text-left">vistas complejas</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Número de tablas</td>
<td class="text-left">Una</td>
<td class="text-left">Una o más</td>
</tr>

<tr>
<td class="text-left">Contiene funciones</td>
<td class="text-left">No</td>
<td class="text-left">Si</td>
</tr>

<tr>
<td class="text-left">Contiene Grupos de datos</td>
<td class="text-left">No</td>
<td class="text-left">Si</td>
</tr>

<tr>
<td class="text-left">DML a través de la vista</td>
<td class="text-left">Si</td>
<td class="text-left">No siempre</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-8-3-5" class="outline-4">
<h4 id="sec-8-3-5"><span class="section-number-4">8.3.5</span> Modificando una Vista</h4>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2020-12-25 Fri 16:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.5)</p>
</div>
</footer>
</body>
</html>
